saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/NXP.MKE06Z4_DFP.11.0.0.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc" Cversion="2.0.0" condition="device.MKE06Z4_AND_driver.common">
      <description>ADC12 Driver</description>
      <files>
        <file category="sourceC" name="drivers/fsl_adc.c"/>
        <file category="header" name="drivers/fsl_adc.h"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.1.0" condition="device.MKE06Z4_AND_driver.common">
      <description>Clock Driver</description>
      <files>
        <file category="header" name="drivers/fsl_clock.h"/>
        <file category="sourceC" name="drivers/fsl_clock.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.0.1" condition="device.MKE06Z4_AND_device.MKE06Z4_CMSIS_AND_driver.clock">
      <description>COMMON Driver</description>
      <files>
        <file category="header" name="drivers/fsl_common.h"/>
        <file category="sourceC" name="drivers/fsl_common.c"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Csub="project_template" Cvariant="MKE06Z4" Cversion="1.0.0" condition="device.MKE06Z4_AND_component.serial_manager_uart_AND_component.uart_adapter_AND_device.MKE06Z4_startup_AND_driver.clock_AND_driver.common_AND_driver.gpio_1_AND_driver.port_ke06_AND_driver.uart_AND_utility.debug_console" isDefaultVariant="1">
      <description/>
      <files>
        <file category="header" attr="config" name="project_template/board.h"/>
        <file category="sourceC" attr="config" name="project_template/board.c"/>
        <file category="header" attr="config" name="project_template/clock_config.h"/>
        <file category="sourceC" attr="config" name="project_template/clock_config.c"/>
        <file category="header" attr="config" name="project_template/pin_mux.h"/>
        <file category="sourceC" attr="config" name="project_template/pin_mux.c"/>
        <file category="header" attr="config" name="project_template/peripherals.h"/>
        <file category="sourceC" attr="config" name="project_template/peripherals.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="Startup" Csub="MKE06Z4_startup" Cversion="1.0.0" condition="device.MKE06Z4_AND_CMSIS_Include_core_cm0plus">
      <description/>
      <files>
        <file condition="iar" category="sourceAsm" attr="config" name="iar/startup_MKE06Z4.s"/>
        <file condition="mdk" category="sourceAsm" attr="config" name="arm/startup_MKE06Z4.s"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKE06Z128xxx4_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKE06Z128xxx4_ram.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKE06Z64xxx4_flash.scf"/>
        <file condition="mdk" category="linkerScript" attr="config" name="arm/MKE06Z64xxx4_ram.scf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKE06Z128xxx4_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKE06Z128xxx4_ram.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKE06Z64xxx4_flash.icf"/>
        <file condition="iar" category="linkerScript" attr="config" name="iar/MKE06Z64xxx4_ram.icf"/>
        <file category="header" attr="config" name="fsl_device_registers.h"/>
        <file category="header" attr="config" name="MKE06Z4.h"/>
        <file category="header" attr="config" name="MKE06Z4_features.h"/>
        <file category="sourceC" attr="config" name="system_MKE06Z4.c"/>
        <file category="header" attr="config" name="system_MKE06Z4.h"/>
      </files>
    </component>
  </components>
</package>
